[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.js:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "RosterStudentForm";
+  const testIdPrefix = "";
 
   return (
killedBy: RosterStudentForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RosterStudentForm-studentId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.js:27:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="studentId">Student Id</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-studentId"}
+          data-testid={testIdPrefix + ""}
           id="studentId"
           type="text"
killedBy: RosterStudentForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RosterStudentForm-studentId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentForm.js:47:37
           id="firstName"
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
-          {...register("firstName", {
-            required: "First Name is required.",
-          })}
+          {...register("firstName", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RosterStudentForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /First Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentForm.js:72:8
         </Form.Control.Feedback>
       </Form.Group>
 
-      {!initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="email">Email</Form.Label>
-          <Form.Control
-            id="email"
-            type="text"
-            isInvalid={Boolean(errors.email)}
-            {...register("email", {
-              required: "Email is required.",
-            })}
-          />
-          <Form.Control.Feedback type="invalid">
-            {errors.email?.message}
-          </Form.Control.Feedback>
-        </Form.Group>
-      )}
+      {false}
 
       {initialContents && (
killedBy: RosterStudentForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RosterStudent/RosterStudentForm.js:89:8
         </Form.Group>
       )}
 
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="email">Email</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-email"}
-            id="email"
-            type="text"
-            {...register("email")}
-            value={initialContents.email}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="email">Email</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "-email"} id="email" type="text" {...register("email")} value={initialContents.email} disabled />
+        </Form.Group>}
 
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: RosterStudentForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentForm.js:89:8
         </Form.Group>
       )}
 
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="email">Email</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-email"}
-            id="email"
-            type="text"
-            {...register("email")}
-            value={initialContents.email}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: RosterStudentForm tests renders correctly when passing in initialContents
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.js:96:26
             data-testid={testIdPrefix + "-email"}
             id="email"
             type="text"
-            {...register("email")}
+            {...register("")}
             value={initialContents.email}
             disabled
killedBy: RosterStudentForm tests renders correctly when passing in initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
