[Timeout] BlockStatement
main/components/Users/RoleEmailTable.js:5:66
 import OurTable from "main/components/OurTable";
 import { ButtonColumn } from "main/components/OurTable";
 
-export default function RoleEmailTable({ data, deleteCallback }) {
-  const columns = [
-    {
-      Header: "Email",
-      accessor: "email",
-    },
-    // The delete button column calls deleteCallback with the cell info when clicked
-    ButtonColumn("Delete", "danger", deleteCallback, "RoleEmailTable"),
-  ];
-
-  return <OurTable data={data} columns={columns} testid={"RoleEmailTable"} />;
-}
+export default function RoleEmailTable({ data, deleteCallback }) {}
 

[Killed] StringLiteral
main/components/Users/RoleEmailTable.js:12:18
       accessor: "email",
     },
     // The delete button column calls deleteCallback with the cell info when clicked
-    ButtonColumn("Delete", "danger", deleteCallback, "RoleEmailTable"),
+    ButtonColumn("", "danger", deleteCallback, "RoleEmailTable"),
   ];
 
killedBy: RoleEmailTable renders table with email data
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/RoleEmailTable.js:15:58
     ButtonColumn("Delete", "danger", deleteCallback, "RoleEmailTable"),
   ];
 
-  return <OurTable data={data} columns={columns} testid={"RoleEmailTable"} />;
+  return <OurTable data={data} columns={columns} testid={""} />;
 }
 
killedBy: RoleEmailTable renders table with correct testid
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RoleEmailTable-header-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
