[Killed] BooleanLiteral
main/pages/Admins/AdminsCreatePage.js:8:56
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function AdminsCreatePage({ storybook = false }) {
+export default function AdminsCreatePage({ storybook = true }) {
   const objectToAxiosParams = (admin) => ({
     url: "/api/admin/post",
killedBy: AdminsCreatePage tests default prop storybook is false and controls redirect
statusReason: Error: Unable to find an element by: [data-testid="admins-list-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Admins/AdminsCreatePage.js:9:31
 import { toast } from "react-toastify";
 
 export default function AdminsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (admin) => ({
-    url: "/api/admin/post",
-    method: "POST",
-    params: {
-      email: admin.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (admin) => {
killedBy: AdminsCreatePage tests default prop storybook is false and controls redirect
statusReason: Error: Unable to find an element by: [data-testid="admins-list-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admins/AdminsCreatePage.js:10:10
 
 export default function AdminsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (admin) => ({
-    url: "/api/admin/post",
+    url: "",
     method: "POST",
     params: {
killedBy: AdminsCreatePage tests default prop storybook is false and controls redirect
statusReason: Error: Unable to find an element by: [data-testid="admins-list-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admins/AdminsCreatePage.js:11:13
 export default function AdminsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (admin) => ({
     url: "/api/admin/post",
-    method: "POST",
+    method: "",
     params: {
       email: admin.email,
killedBy: AdminsCreatePage tests default prop storybook is false and controls redirect
statusReason: Error: Unable to find an element by: [data-testid="admins-list-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] ObjectLiteral
main/pages/Admins/AdminsCreatePage.js:12:13
   const objectToAxiosParams = (admin) => ({
     url: "/api/admin/post",
     method: "POST",
-    params: {
-      email: admin.email,
-    },
+    params: {},
   });
 

[Killed] BlockStatement
main/pages/Admins/AdminsCreatePage.js:17:32
     },
   });
 
-  const onSuccess = (admin) => {
-    toast(`New Admin Created - email: ${admin.email}`);
-  };
+  const onSuccess = (admin) => {};
 
   const mutation = useBackendMutation(
killedBy: AdminsCreatePage tests onSuccess calls toast with the new admin's email
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New Admin Created - email: toastcheck@example.com"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/pages/Admins/AdminsCreatePage.js:29:30
 
   const { isSuccess } = mutation;
 
-  const onSubmit = (data) => {
-    mutation.mutate(data);
-  };
+  const onSubmit = (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: AdminsCreatePage tests default prop storybook is false and controls redirect
statusReason: Error: Unable to find an element by: [data-testid="admins-list-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Admins/AdminsCreatePage.js:33:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    // After success, navigate back to admins list page
-    return <Navigate to="/admin/admins" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: AdminsCreatePage tests default prop storybook is false and controls redirect
statusReason: Error: Unable to find an element by: [data-testid="admins-list-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
