[Killed] ArrayDeclaration
main/pages/Admins/AdminsIndexPage.js:20:5
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/admin/all"],
+    [],
     { method: "GET", url: "/api/admin/all" },
     [],
killedBy: AdminsIndexPage mutation survival tests refetches admin list on delete and shows updated data
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RoleEmailTable-cell-row-0-col-email" role="cell">user1@example.com</td> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Timeout] ObjectLiteral
main/pages/Admins/AdminsIndexPage.js:21:5
     status: _status,
   } = useBackend(
     ["/api/admin/all"],
-    { method: "GET", url: "/api/admin/all" },
+    {},
     [],
   );

[Timeout] StringLiteral
main/pages/Admins/AdminsIndexPage.js:21:27
     status: _status,
   } = useBackend(
     ["/api/admin/all"],
-    { method: "GET", url: "/api/admin/all" },
+    { method: "GET", url: "" },
     [],
   );

[Killed] ArrayDeclaration
main/pages/Admins/AdminsIndexPage.js:22:5
   } = useBackend(
     ["/api/admin/all"],
     { method: "GET", url: "/api/admin/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: AdminsIndexPage mutation survival tests mutation invalidates correct cache keys (empty array)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/api/admin/all"]

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrowFunction
main/pages/Admins/AdminsIndexPage.js:26:5
   );
 
   const deleteMutation = useBackendMutation(
-    (cell) => ({
-      url: "/api/admin/delete",
-      method: "DELETE",
-      params: { email: cell.row.original.email },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: AdminsIndexPage mutation survival tests mutation shows permission error on 403 response
statusReason: Error: Unable to find an element with the text: You do not have permission to delete this admin.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admins/AdminsIndexPage.js:28:15
   const deleteMutation = useBackendMutation(
     (cell) => ({
       url: "/api/admin/delete",
-      method: "DELETE",
+      method: "",
       params: { email: cell.row.original.email },
     }),
killedBy: AdminsIndexPage mutation survival tests mutation shows permission error on 403 response
statusReason: Error: Unable to find an element with the text: You do not have permission to delete this admin.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Admins/AdminsIndexPage.js:29:15
     (cell) => ({
       url: "/api/admin/delete",
       method: "DELETE",
-      params: { email: cell.row.original.email },
+      params: {},
     }),
     {
killedBy: AdminsIndexPage mutation survival tests refetches admin list on delete and shows updated data
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RoleEmailTable-cell-row-0-col-email" role="cell">user1@example.com</td> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Survived] BlockStatement
main/pages/Admins/AdminsIndexPage.js:32:24
       params: { email: cell.row.original.email },
     }),
     {
-      onSuccess: () => {
-        setErrorMessage(""); // clear error on success
-      },
+      onSuccess: () => {},
       onError: (error) => {
         if (error.response?.status === 403) {

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:35:27
       onSuccess: () => {
         setErrorMessage(""); // clear error on success
       },
-      onError: (error) => {
-        if (error.response?.status === 403) {
-          setErrorMessage("You do not have permission to delete this admin.");
-        } else {
-          setErrorMessage("An unexpected error occurred. Please try again.");
-        }
-      },
+      onError: (error) => {},
     },
     ["/api/admin/all"],
killedBy: AdminsIndexPage mutation survival tests mutation fails and shows error when params are empty
statusReason: Error: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/Admins/AdminsIndexPage.js:36:13
         setErrorMessage(""); // clear error on success
       },
       onError: (error) => {
-        if (error.response?.status === 403) {
+        if (error.response?.status !== 403) {
           setErrorMessage("You do not have permission to delete this admin.");
         } else {
killedBy: AdminsIndexPage mutation survival tests mutation fails and shows error when params are empty
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  An unexpected error occurred. Please try again.
Received:
  You do not have permission to delete this admin.

Ignored nodes: comments, script, style

[Killed] OptionalChaining
main/pages/Admins/AdminsIndexPage.js:36:13
         setErrorMessage(""); // clear error on success
       },
       onError: (error) => {
-        if (error.response?.status === 403) {
+        if (error.response.status === 403) {
           setErrorMessage("You do not have permission to delete this admin.");
         } else {
killedBy: AdminsIndexPage mutation survival tests shows generic error message when error has no response property
statusReason: Error: Unable to find an element with the text: An unexpected error occurred. Please try again.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Admins/AdminsIndexPage.js:38:16
       onError: (error) => {
         if (error.response?.status === 403) {
           setErrorMessage("You do not have permission to delete this admin.");
-        } else {
-          setErrorMessage("An unexpected error occurred. Please try again.");
-        }
+        } else {}
       },
     },
killedBy: AdminsIndexPage mutation survival tests mutation fails and shows error when params are empty
statusReason: Error: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admins/AdminsIndexPage.js:39:27
         if (error.response?.status === 403) {
           setErrorMessage("You do not have permission to delete this admin.");
         } else {
-          setErrorMessage("An unexpected error occurred. Please try again.");
+          setErrorMessage("");
         }
       },
killedBy: AdminsIndexPage mutation survival tests mutation fails and shows error when params are empty
statusReason: Error: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admins/AdminsIndexPage.js:43:6
         }
       },
     },
-    ["/api/admin/all"],
+    [""],
   );
 
killedBy: AdminsIndexPage mutation survival tests cache invalidation triggers for /api/admin/all after delete mutation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/api/admin/all",
+   "",

[Killed] ArrayDeclaration
main/pages/Admins/AdminsIndexPage.js:43:5
         }
       },
     },
-    ["/api/admin/all"],
+    [],
   );
 
killedBy: AdminsIndexPage mutation survival tests cache invalidation triggers for /api/admin/all after delete mutation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "/api/admin/all",
- ]

[Timeout] BlockStatement
main/pages/Admins/AdminsIndexPage.js:47:36
   );
 
   // Callback function passed to the table
-  const deleteCallback = (cell) => {
-    deleteMutation.mutate(cell);
-  };
+  const deleteCallback = (cell) => {};
 
   // Use props admins if provided, else fallback to backend data

[Killed] ConditionalExpression
main/pages/Admins/AdminsIndexPage.js:52:18
   };
 
   // Use props admins if provided, else fallback to backend data
-  const admins = adminsFromProps || adminsFromBackend;
+  const admins = true;
 
   return (
killedBy: AdminsIndexPage mutation survival tests errorMessage initial state is empty string
statusReason: TypeError: data.forEach is not a function

[Killed] ConditionalExpression
main/pages/Admins/AdminsIndexPage.js:52:18
   };
 
   // Use props admins if provided, else fallback to backend data
-  const admins = adminsFromProps || adminsFromBackend;
+  const admins = false;
 
   return (
killedBy: AdminsIndexPage mutation survival tests errorMessage initial state is empty string
statusReason: TypeError: data.forEach is not a function

[Killed] LogicalOperator
main/pages/Admins/AdminsIndexPage.js:59:10
       <div className="pt-2">
         <h1>Admins</h1>
 
-        {errorMessage && (
-          <div
-            className="alert alert-danger"
-            role="alert"
-            data-testid="AdminsIndexPage-error"
-          >
-            {errorMessage}
-          </div>
-        )}
+        {errorMessage || <div className="alert alert-danger" role="alert" data-testid="AdminsIndexPage-error">
+            {errorMessage}
+          </div>}
 
         <Button
killedBy: AdminsIndexPage mutation survival tests errorMessage initial state is empty string
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="alert alert-danger" data-testid="AdminsIndexPage-error" role="alert" /> instead

[Killed] ConditionalExpression
main/pages/Admins/AdminsIndexPage.js:59:10
       <div className="pt-2">
         <h1>Admins</h1>
 
-        {errorMessage && (
-          <div
-            className="alert alert-danger"
-            role="alert"
-            data-testid="AdminsIndexPage-error"
-          >
-            {errorMessage}
-          </div>
-        )}
+        {false}
 
         <Button
killedBy: AdminsIndexPage mutation survival tests mutation fails and shows error when params are empty
statusReason: Error: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
