[Killed] BlockStatement
main/components/Users/RoleEmailTable.js:4:66
 import OurTable from "main/components/OurTable";
 import { ButtonColumn } from "main/components/OurTable";
 
-export default function RoleEmailTable({ data, deleteCallback }) {
-  const columns = [
-    {
-      Header: "Email",
-      accessor: "email",
-    },
-    ButtonColumn("Delete", "danger", deleteCallback, "RoleEmailTable"),
-  ];
-
-  return <OurTable data={data} columns={columns} testid={"RoleEmailTable"} />;
-}
+export default function RoleEmailTable({ data, deleteCallback }) {}
 
killedBy: RoleEmailTable renders table with email data
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrayDeclaration
main/components/Users/RoleEmailTable.js:5:19
 import { ButtonColumn } from "main/components/OurTable";
 
 export default function RoleEmailTable({ data, deleteCallback }) {
-  const columns = [
-    {
-      Header: "Email",
-      accessor: "email",
-    },
-    ButtonColumn("Delete", "danger", deleteCallback, "RoleEmailTable"),
-  ];
+  const columns = [];
 
   return <OurTable data={data} columns={columns} testid={"RoleEmailTable"} />;
killedBy: RoleEmailTable renders table with email data
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
